#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "448e2b647a26ade3d72a31091cf3856c" -> "d4c7f0361eb1397e0be718d2ff6882e8"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "a303848132695df8f36330b8b33333d3" -> "549d990ee88a713cca0d8cb8b318b14b"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "02d6eb3ac5425cf8ea156e056712bcec" -> "3dbf441991dfe70d42e6d27dc5471c81"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "f108c2fa6cec46c701427924ccc87793" -> "1fb9e6e622e5db276fd4ffbfa10f8363"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "db796517f3bb0b39a2cc3f31901dda3f" -> "6708f8e2780fd5b0f5c12bf1f19237e8"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "20148e9792af1b47827fb20281a95c85" -> "8ca3c8aaa83f7387496d80dcee1088b2"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "f2b2953b02fcc285913447083182c871" -> "5042df9dd332d105ee385074f75467a0"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "89bfddd20f4a1a5b30541a47e0441781" -> "767365e9b8d7d3ec2ff48e814c957e83"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "5319c5d0db60a4869fef9239a636b63e" -> "a31f8944ab6b78bb377f8749b0552d4d"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "c640664b9a963a74219b53b26648c55b" -> "f6a350f7ee7049de89c634af3349efad"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "216ce8f64edac5031e9668b4a66ccfa9" -> "dd5866e5c81190f602662c92cec7596f"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "b11ef3f9e87c280818fe2ad4d2b72f97" -> "0a8da429b80cbbc2e73122d456f0ff30"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "a77e2f1e327b7a35241f6319d5164d2c" -> "1ef45c7cf38d7a93575aaba1be9114a1"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "c3e8e84623cbfa3e323dd369ceb3aa1e" -> "83e5d8e6b60b3f07cf57977cb7658091"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "fa87849bd4a2afa276b3de12b45e7a9d" -> "2ba3259ac71dff49255cf4dc20636e85"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "9b47fadb013b3074fe85fc02fc7e6dc5" -> "06f64500e1fe7cdc14ad3d4a1d458b8c"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "075110e8918873d25ab7631a0dfbb680" -> "60793ad67fa70143f5cf4777226d439f"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "f0795152ae579154554ea9482c635839" -> "ffca1d4d0b5ab534378f5c42774a9e25"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "9942c5a98a48bc9dd9ff1054deab37fb" -> "f6a94186993e33f76d2e2b2b4020b05d"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "5665f585e0bd9cf2b94dfc818a46f8a5" -> "f0ed5d227229ee75ce217557f15cb780"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "8fb308cc40d9c35519eae34f6c0ba3ba" -> "600c55ffa6ab12f0dca1bcd2107101f9"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "7a7cd5db74ea8b5cc82ea4bc6e837016" -> "023f3db3fb0ee457cc18a6a17c42d530"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "3e2f1145f96aadc2f7ea61435b3bf9df" -> "0d8f0f3c23bfe6ee945fdf8b48f1ba27"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "5379b86439a807143e735c8a194f7d71" -> "ce3142c305508bf1296813ffeacd2e8c"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "444d13d93fe6c0efbe114c88da47042d" -> "89354c05d2a55e50c08dbf7f9565f76f"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "1b0e2b2ad5b4eac0780de76487dce626" -> "a0e9d98145fe5b19d1b002aeefd4850a"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "e9f3cd04f7e1b9441e181a3460c8ed0a" -> "375626eaf29ec2be92ca0d1e074437e7"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "5aca3dd060901f0a79ebf704d181042e" -> "570e9d896a9e75e3fb3fa3e245789c97"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "57ef1c09b7a28b37a0fd989f8854528d" -> "2e0d9b90c22c8f5cf4976433044db242"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag               = "385bed8a5838423a346c41e7179c2c0d" -> "bfa9d9d9b2b44cc405b9872ba6f4d1a9"
        id                 = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "9fd157114eeb391a25af06295ecfc506" -> "3f4359e60f2a90273f3b40923467faa7"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "278ae57f62452ed81fc6721e0d88e6bb" -> "8d12e400e09ff4bdd39b2b91a6bfc7d7"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "893c22679d966571943e0ddb0be7abc9" -> "1999a31aade81c735311946d0b92af1e"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "324bedf7cbf3d5093f6c7598ca31e34a" -> "0d6fd92e15902fc1b812d173f3c798e0"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "16bb901245d09c940245a5761b59b3dc" -> "835c4d87d927e15278749eb2b1296b50"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "a4ec2b466b4f96779a0f7a400f0380da" -> "cf2f9a878276a2a65e89f49a550e93db"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "afd5ebd1e3a09a7953c95fa0ad4f7319" -> "9abd3c357608c6351796646a63e7ef85"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "441c11724293d80d1ea0c7043e676a1a" -> "2c9eb242262341d93537278cef461bfd"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag               = "5c9c7f8b1fc53597bd60734c1d333ac7" -> "ff52efdb2cc194a3ff774b0dda7ee1a7"
        id                 = "lambdas/demo/modify_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "53ca17ff831da09bfbf5b664951a523a" -> "6d5628e96039876ffd1ff1cffcd8981c"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "e9f23b5bac31edb860f59c39cee29111" -> "3aaa57198b64e0e266418325d12bf939"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "26f14f9b234e288d318f41e3fcef5c31" -> "6456262c1fc9ad053164771019012930"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "58295533e114045695b529c228f676e9" -> "b5183eac6f4c72fffb51a30202c85a82"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "502f71e136ad9880dc8fab2b5a8e88a8" -> "a8fffed86645898cdac7d1232c8ffa8b"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "8c91a38cac7b064b8893e2ac9a673977" -> "dbf434be474dc6b2c306d9b1d4e9c7cf"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "139LboloGZIVHuVchzwQ/vkG7Cg/HIHFyW1npvtjTOs=" -> "oA7Cww+B55SVzWgbqmtACwxKB6uOmmC1yX08XBnKhY4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "ML6EqWG2rxLtBdImr5ZDVo6X0AYw5MjQLUToF7qE5Yg=" -> "jsjjxEykrpm/BYU2OmR9XziLuUARiQZNkpgaTYC5rXU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "67zHgmYfvH62iEQveQ4FNiMh6anJ2dO7EOk/9uFlp08=" -> "czofJIBa++exK54dVQwOL3XIoQbZtR3c0dCENMM5nQE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "m6Sm/trHPTokAZbsaNL98o8BkdNMi4SaFW0ousWkGx4=" -> "g7J/AQOOtCEjZEpMR1kmedRMV2emCxCbmfgLVXlFBMw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-12-01T20:44:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "IEf7BhQlp5ZJURsBTAZSia+VgZzKnOq/dGDJv/wqw7Q=" -> "0y/Ltdout70PjMINCE9bN0xFOuYKyf9zLwljTMnI1WQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "lfQGN1HA8SBuM5/0f1GlxacsUcR9nrE9Q7dauXQf68o=" -> "KFmMwh+VHhgbDudRLdwhlc9Dn7OKJ2w0uXjm6ee0ZQg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "aPPo6r/T3V9/FTKQ4bBpssUREY86L2lNvcLh2vaERcY=" -> "rZ8LRbWDAG3zR2jJeezrBFlkbj5xxMbovtlOqX3Y5fk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "jJvpjkgXJTNU0bgCmBiq1rlnrS31uKYfO2ySmlrCb/8=" -> "ZlFfdFqTzfhXImkgFun663RKgMYTU0eJ1H38UoVdLas="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:21.000+0000" -> (known after apply)
      ~ source_code_hash               = "P5FTQJyXBsnn1RigT8yifv4l3uLlrV8X5Tz0ie12lnU=" -> "0+nx4z5dXlAa6ogN7xDzxAdgbKLz0iUgsm3Py49DVwk="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "zr//wfz2is3iXnef+E7KtjlGAnDH0I4mrVc0Mr0Pz44=" -> "KMF2u4ysqWisLcCim9y5gQhcgMoiDYySEZJva/sM1oI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-12-01T20:44:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "tLhp1pk4T2bqIVHq8wLZjcuPs2KYBBu5011StIGaFNw=" -> "Z/T0UrKzyRPenIB9wN/O6BqrdGEfWy/e/0WHfqkKS2c="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2022-12-01T20:44:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "DPEusTxBYm0/sMQw0KfiIsx0c4imieq1rM9K05/oxeE=" -> "qPWRW9ixhl2KDr0thCC4wvnHIRT/dxh2rCSDkSrN1P0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "CqORXONbeW3ycINK+iNoc4IznMi+6Tf25Egzq1e7DhA=" -> "pVDXDfzQmjW2nepnXetBYMx2/HsphlaQFgghp6BhQP8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "09m1b2MgFJ06KyzIaC/LmXz4R1RUyVNz5Az6+YmvMD0=" -> "tKlyob+H78Oea0E+8XTlZLq2WINyP0/yeHLnJT876pE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "dNlz6CLNBj4gS8yXo0Zp/V8QWFWuHA1vCMX0YxPq8nE=" -> "G9a9Ofk0zoh+XMAfl8T0Lm6CmYtq6TFpizDBasrhAIc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "5/IBKXBBRvdoZYAz6qsApHd+rpjsE2CBp1/pkGeXV08=" -> "VbyebKDSPtNlzwmODNPq+83MgBUAPq8yXwdhR3i6Piw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "W2BPFimgPcle6FU9piAWlARV/kB8XhWdBZKxoJTKDQ0=" -> "7gdoEHMD7ECnonnwK1pQ/yTDzMijxSoqdDqJINWS4Lw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "cG+mqEUu2q8wwwQyGogKykhltuIKB6C7Jy8F9RC920Q=" -> "LZms7wGT3xlTkOdFXJKt7LtmPyRJjB3+UBadD/87T0U="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "gcMH3+M5w4O3idQwNBQPB9+p19rNlg/HfN1hphCtLxE=" -> "psU0TKWUoXp4ZlaVGn0DOGwD06IcQlRuw6L593CeqVc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "l+ShIYZtn/2ejoLfnf0rsaVKkv73RyPqKrIZzvEgY+I=" -> "Jdkk9jgaWhnE4AIM103+rIzgXuEPNGsSEbhLqRtXBDk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "JfSwym73YkpyU+AfYIfL8Ann7Tqt9+J9Gdt+D1DMB58=" -> "YXwoyOuSY0e2fklfPqITLqNDLS6ESUHLUkTRNpGykgQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "KhueoGP5CCuPCfGgq5NbG75L6SSQJQBYMbDYxpz2DYo=" -> "Dz3DTTmyzLbTcbmBGTNubwyhCwQJl2anIqd305ehUEg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "AlPJbff1K7EbLU5KNqGWrhvrxaishY0ovU4P8gilIzE=" -> "EJAgUa8tAgV5Nm6TQRczzz4YB+kxzu1q0Pf7joPdfAM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "0uVXlnBNH9V6c/Nfq5n/IOgDbatcIZJ7kmJmx8uJL88=" -> "E6ZFOl13xx4IcEIIa+aezlQdddgYLkqsiWVQF/Gpi9Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "P4aSC7lz0pevAFGp+uDQrg1d0FLCMJd8pfMSk6L7hPw=" -> "gpw/h9LSotQ+8s69p/DfpxtUH+P7wZymWudzRkQqH0A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "lIA58UYcQn3O8Oo8MDT4IRj0J2iv9t5Nb64nRYGkUCc=" -> "6HryuJyh2yWHsXFqyW4KZ1aYFbbotrusdB0CA7EUf+A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "m2F33mFFz+rnPyL0GUVcf3CLIlf5U6WuumbMzF8WSVE=" -> "wyvWrRtJx+LUqpHfTe7T0HdEYjmCAA4nVKOW8tHxWcY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "m7cNqzKhzJHNg8th9wSOhhWEYcwxql30Z3yaGoYT2fE=" -> "1cfN6TJTvNY8ePNQVI/Ca9WQ2BRp7tN1ghMnWhELqeI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:27.000+0000" -> (known after apply)
      ~ source_code_hash               = "JCLWpKM50/XQIkwmJG67GX8qCFLO93MPZ3gv7gEZ9+o=" -> "B0uRc3lMlTV/mToRe/GcDQKu0nb2PFDXSbZx2gLTfg8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "KV6SrIKJcwn+nHU+5Kzp9QXS6CqLHv7qmYvWfF0FO5g=" -> "JIPSWPNmGUBVGZhlzbx1qNQcP4vU5etBIIDqQkgib6Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "ITztasm036d3VV06ltFmWdYvblyOhHkqvFLbtCtqAlY=" -> "HEldibCUy6Mq2OEPMrNkk7XwV77o8nl3F+R3gOc39yQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "wIP4kTfwVDRrNHNW4wj3Vx8Zc9//6EvtvflAqdeN8DI=" -> "AzPZ2PFtb13OweoiGLcVDycFGWBPrwnMicc2Sr9SIWc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-12-02T19:07:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "sbqHY0DPa/Yx4QVe1PG7lakx2T+Z3aCbV3F7Ugysd5A=" -> "u9zBoHwvEpVAzTqM3BnAhH1LG5SgLtYdtlYFOTszriY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "1xCNRGYbXMEH1mdBQx4KZensBQguD9hKLBtbZW7TxhI=" -> "HTTrSH9HF8UuRLF9nz8PIjrxktEV09MNGSnkQ/jFGnY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "/X2VytJJzg8zrOizLFYwO8Kj/ysH2n5cw/UVD/yvV/4=" -> "ZiVNCmoylOnI/TNLnBreuQ5NskqzBNBVWmQjC7luooc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "4JyzSCc+mGbhwOcG6cR2ZrMbGumVY4/zrU0SRrRekMo=" -> "t6L2foiI2zCLhx1Sa8fnJxpSok84NvSTv2EIJ/S+tsg="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-12-01T20:44:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "IS7mtRwixMpOHzGLQG3JmZgzp9W2oQI7XE12vNGJJO0=" -> "acT+FWo1xWMYP+ltEtndKkId82PWfVB9pSUv8QgsTFs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "fnbY8OKAQ+1TPqKOMBjYKMPdyOHwbiGsdYCtUPNUeGE=" -> "KDdJeamAVybcpXv2Xjdvi5mA3/VBFWFV2B3X6beG8B4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-12-01T20:44:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "mVwhIm3LJvBJov1DsMbbqAbw4riYpXnwQoF0w9S/YsU=" -> "KtTbk68ZqUy6++HWZfDsKiKeVPsrgFr+O8T6TUYAL5w="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "XTPkPzJ+6I9zundN0EaQgRyOPzFqwnsbiNo5BU4HLfU=" -> "1jKOvgl2yIHalNuhdl935tvqvWggG7JT1MUteUJ0JwU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "8cFh9AJP5uaeZbuTFpDuZf14n7/xwNi31VszDQ4tFAU=" -> "YLNOgvHdkuwRn1VB3EFIAJfngLYPb7barA/9xNjaoe8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "H//1MavS3AHgUga7zWzYcRDNHkYPMT6wpPMqtCr6juM=" -> "+QwpBfudAqO5qoO1C3+E0sA9twOEc2HIpBRvD6l+jxg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-12-01T20:44:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "3xn9F4gqdaGcauXSbxc09PF28UItfgdwSGuJsUn88RY=" -> "MGJVgIcx6sVl+WLGuFu8VQ5i4nrpDQAtr7fcCm+KJIs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "AlXkcwdp2UzQi6AqvK94ux1/4TiS1yu+ZE4s/tpjF7o=" -> "rtQtF/I1qSYft6AerOz8ahpwK9mb9E5dGq6Fe7JzGH4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-12-01T20:43:20Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "7h2ws0" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-12-01T20:43:19Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-12-01T20:43:20Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 91 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @dsgarcia8, Action: `pull_request`*